package practice.lessons.task3.oop;
/*
1	Создать класс Book c полями id (тип int), name (тип String), author (тип String), издательство ( тип String ), Год издания(тип Int), Количество старниц (тип int), цена (double).Инициализацию книги в классе main выполнять через конструктор с параметрами. Также определите конструктор без параметров.
2	Создать метод, который будет выводить информацию по полям которые есть в классе и назвать его info
3	Создать метод, который будет изменять ценц книги (сам метод в качестве параметра будет принимать новую цену)

4	В классе main создать массив из пяти книг
5	Создать метод в классе Book, который будет принимать массив книг и возвращать из массив книг, у которых год издания ниже переданной года в методе.
 */

public class Main {
}
